{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "admin_add_food",
    "1": "admin_add_restaurant",
    "2": "admin_delete_food",
    "3": "admin_delete_restaurant",
    "4": "admin_list_foods",
    "5": "admin_list_orders",
    "6": "admin_list_restaurants",
    "7": "admin_update_order_status",
    "8": "admin_view_stats",
    "9": "customer_add_to_cart",
    "10": "customer_order_history",
    "11": "customer_place_order",
    "12": "customer_search_food_category",
    "13": "customer_search_food_name",
    "14": "customer_track_order",
    "15": "customer_view_cart"
  },
  "initializer_range": 0.02,
  "label2id": {
    "admin_add_food": 0,
    "admin_add_restaurant": 1,
    "admin_delete_food": 2,
    "admin_delete_restaurant": 3,
    "admin_list_foods": 4,
    "admin_list_orders": 5,
    "admin_list_restaurants": 6,
    "admin_update_order_status": 7,
    "admin_view_stats": 8,
    "customer_add_to_cart": 9,
    "customer_order_history": 10,
    "customer_place_order": 11,
    "customer_search_food_category": 12,
    "customer_search_food_name": 13,
    "customer_track_order": 14,
    "customer_view_cart": 15
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
